app/views/devise/registrations/new.html.erb

<script type="text/javascript">
  $(document).ready(function() {
  $('#assign_manager').hide();
  $('#user_type').on("click", function(){
    console.log("value", this.value);
    if(this.value == 'Users::Manager'){
      $('#assign_manager').hide();
    }else{
      $('#assign_manager').show();
    }
  })
})
---
SELECT  "users".* FROM "users" WHERE "users"."type" IN ('Users::Manager') AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]