app/views/users/_manager_leads.html.erb

           <%= f.hidden_field :id, value: lead_generator.id %>
           <%= f.select :parent_id, options_for_select(Users::Manager.all.map {|a| [a.name, a.id] }, lead_generator.manager.id),{},{class: "form-control"}%>
---
SELECT  "users".* FROM "users" WHERE "users"."type" IN ('Users::Manager') AND "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]