app/controllers/emails_controller.rb

  def create
    sending_emails = email_params['reciever_id'].tap { |hs| hs.delete('reciever_id') }
    # send_mails here
    sending_params = {subject: email_params['subject'], body: email_params['body']}
    unless email_params['to_be_sent_in'].blank?
      UserMailer.send_email(current_user, sending_emails.reject(&:blank?), sending_params).deliver_later(wait_untill: email_params['to_be_sent_in'].to_i.minutes)
    else
      UserMailer.send_email(current_user, sending_emails.reject(&:blank?), sending_params).deliver
    end
    email_params['reciever_id'].reject(&:blank?).each do |reciever_email|
      lead  = Lead.where("email OR email2 IN (?)", reciever_email).first rescue nil
      next(reciever_email) unless lead
      @email = Email.new(email_params.merge(reciever_id: lead.id, lead_generator_id: lead.lead_generator.id, reciever_email: reciever_email))
      @email.save
---
SELECT  "leads".* FROM "leads" WHERE (email OR email2 IN ('ijtsidjf@fcdasf.com')) ORDER BY "leads"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "emails" ("sender_id", "subject", "content", "smtp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sender_id", 6], ["subject", ""], ["content", ""], ["smtp", "Gmail"], ["created_at", "2017-09-01 10:27:02.363210"], ["updated_at", "2017-09-01 10:27:02.363210"]]

  def destroy
    @email.destroy
---
DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 1]]

    def set_email
      @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]