app/controllers/leads_controller.rb

SELECT "leads".* FROM "leads" WHERE (7)
---
  def index
    @leads = Lead.where(params[:lead_id])

INSERT INTO "leads" ("first_name", "last_name", "email", "email2", "phone_number", "phone_number2", "category", "company_url", "about_me", "status", "comment", "lead_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lead = Lead.new(lead_params)

    respond_to do |format|
      if @lead.save

SELECT "leads".* FROM "leads" WHERE "leads"."lead_id" = ?  [["lead_id", 7]]
---
  def show_leads
  	puts "params --- #{params.inspect}"
  	@lead_generators_leads = Lead.where(lead_id: params[:lead_id])