app/controllers/users_controller.rb

  def update_manager
    @user = User.find(params['users_lead_generator'][:id])
---
SELECT  "users".* FROM "users" WHERE "users"."type" IN ('Users::Manager') AND "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]