app/views/emails/index.html.erb

SELECT  "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

  <% lead = Lead.find_by_id(email.reciever_id) %>

SELECT "emails".* FROM "emails"
---
    <div class="email_notes" >
      <% email.email_notes.each do |en| %>